Tekla.Structures.Model.BooleanPart.BooleanTypeEnum
Defines the boolean operation: an add or a cut.

Tekla.Structures.Model.BooleanPart.BooleanTypeEnum.BOOLEAN_ADD
Defines the add part. Typically the add part type is not used.

Tekla.Structures.Model.BooleanPart.BooleanTypeEnum.BOOLEAN_CUT
Defines the cut part.

Tekla.Structures.Model.BooleanPart.BooleanTypeEnum.BOOLEAN_WELDPREP
Defines the weld prep part.